/* TXNPOST: DB2 POSTING SERVICE CALLED FOR EACH VALID PAYMENT. */
TXNPOST: PROC(PARM) OPTIONS(MAIN);
  DCL PARM CHAR(100) VAR;
  DCL SQLCODE FIXED BIN(31) EXTERNAL;
  DCL RETURN_CODE FIXED BIN(31) STATIC INIT(0);
  DCL EOF BIT(1) INIT('0'B);
  DCL FOUND BIT(1) INIT('0'B);
  DCL INFILE FILE RECORD INPUT;
  DCL AUDITF FILE RECORD OUTPUT;
  DCL 1 PAYREC,
        2 PARCEL_NO CHAR(12),
        2 RECEIPT_NO CHAR(16),
        2 PAYMENT_DATE CHAR(8),
        2 AMOUNT PIC 'S999999999V99',
        2 TENDER_CODE CHAR(1),
        2 SOURCE_SYSTEM CHAR(4);
  DCL 1 AUDITREC,
        2 AUDIT_TIME CHAR(26),
        2 AUDIT_RECEIPT CHAR(16),
        2 AUDIT_STATUS CHAR(8),
        2 AUDIT_SQLCODE PIC '-9999999999';
  DCL DB_PARCEL CHAR(12);
  DCL DB_STATUS CHAR(1);
  DCL DB_BALANCE DEC FIXED(11,2);
  DCL DB_PAID DEC FIXED(11,2);
  DCL DB_VERSION FIXED BIN(31);
  DCL WORK_AMOUNT DEC FIXED(11,2);
  EXEC SQL INCLUDE SQLCA;
  ON ENDFILE(INFILE) EOF = '1'B;
  ON ERROR CALL HANDLE_FATAL;
  OPEN FILE(INFILE);
  OPEN FILE(AUDITF);
  EXEC SQL CONNECT TO TAXDB;
  IF SQLCODE ^= 0 THEN DO;
    CALL WRITE_AUDIT('CONNECT ');
    RETURN_CODE = 12;
    GO TO SHUTDOWN;
  END;
  READ FILE(INFILE) INTO(PAYREC);
  DO WHILE(^EOF);
    CALL POST_PAYMENT;
    READ FILE(INFILE) INTO(PAYREC);
  END;
  GO TO SHUTDOWN;
POST_PAYMENT: PROC;
  FOUND = '0'B;
  EXEC SQL SELECT PARCEL_NO, STATUS_CODE, CURRENT_BALANCE,
                  PAID_TO_DATE, ROW_VERSION
             INTO :DB_PARCEL, :DB_STATUS, :DB_BALANCE,
                  :DB_PAID, :DB_VERSION
             FROM TAX_ACCOUNT
            WHERE PARCEL_NO = :PARCEL_NO
            WITH RS USE AND KEEP UPDATE LOCKS;
  IF SQLCODE = 100 THEN DO;
    CALL WRITE_AUDIT('NOTFOUND');
    RETURN;
  END;
  IF SQLCODE ^= 0 THEN DO;
    CALL SQL_FAILURE('SELECT  ');
    RETURN;
  END;
  FOUND = '1'B;
  IF DB_STATUS ^= 'A' THEN DO;
    CALL WRITE_AUDIT('INACTIVE');
    EXEC SQL ROLLBACK;
    RETURN;
  END;
  WORK_AMOUNT = AMOUNT;
  EXEC SQL INSERT INTO TAX_PAYMENT
      (RECEIPT_NO, PARCEL_NO, PAYMENT_DATE, AMOUNT,
       TENDER_CODE, SOURCE_SYSTEM, POSTED_TS)
    VALUES (:RECEIPT_NO, :PARCEL_NO, :PAYMENT_DATE,
            :WORK_AMOUNT, :TENDER_CODE, :SOURCE_SYSTEM,
            CURRENT TIMESTAMP);
  IF SQLCODE ^= 0 THEN DO;
    CALL SQL_FAILURE('INSERT  ');
    RETURN;
  END;
  EXEC SQL UPDATE TAX_ACCOUNT
              SET CURRENT_BALANCE = CURRENT_BALANCE - :WORK_AMOUNT,
                  PAID_TO_DATE = PAID_TO_DATE + :WORK_AMOUNT,
                  ROW_VERSION = ROW_VERSION + 1,
                  LAST_PAYMENT_DATE = :PAYMENT_DATE
            WHERE PARCEL_NO = :PARCEL_NO
              AND ROW_VERSION = :DB_VERSION;
  IF SQLCODE ^= 0 | SQLERRD(3) ^= 1 THEN DO;
    CALL SQL_FAILURE('UPDATE  ');
    RETURN;
  END;
  EXEC SQL COMMIT;
  CALL WRITE_AUDIT('POSTED  ');
END POST_PAYMENT;
SQL_FAILURE: PROC(OPERATION);
  DCL OPERATION CHAR(8);
  PUT SKIP LIST('TXNPOST', OPERATION, RECEIPT_NO, SQLCODE);
  CALL WRITE_AUDIT('DBERROR ');
  EXEC SQL ROLLBACK;
  RETURN_CODE = 8;
END SQL_FAILURE;
WRITE_AUDIT: PROC(STATUS);
  DCL STATUS CHAR(8);
  AUDIT_RECEIPT = RECEIPT_NO;
  AUDIT_STATUS = STATUS;
  AUDIT_SQLCODE = SQLCODE;
  AUDIT_TIME = DATETIME();
  WRITE FILE(AUDITF) FROM(AUDITREC);
END WRITE_AUDIT;
HANDLE_FATAL: PROC;
  PUT SKIP LIST('TXNPOST UNHANDLED CONDITION');
  RETURN_CODE = 20;
  GO TO SHUTDOWN;
END HANDLE_FATAL;
SHUTDOWN:
  IF FOUND THEN EXEC SQL ROLLBACK;
  EXEC SQL DISCONNECT TAXDB;
  CLOSE FILE(INFILE);
  CLOSE FILE(AUDITF);
  RETURN;
END TXNPOST;
