//AIDJOB   JOB (MDE),'AID CALC',CLASS=A,MSGCLASS=X
//STEP010  EXEC PGM=AIDCALC
//DISTIN   DD DSN=MDE.FIN.DISTRICT.INPUT,DISP=SHR
//PAYOUT   DD DSN=MDE.FIN.AID.PAYMENTS,DISP=(NEW,CATLG),
//            SPACE=(TRK,(10,5)),DCB=(RECFM=FB,LRECL=80)
//STEP020  EXEC PGM=AIDRPT
//PAYIN    DD DSN=MDE.FIN.AID.PAYMENTS,DISP=SHR
//SYSOUT   DD SYSOUT=*
