 AIDRPT: PROC OPTIONS(MAIN);
   /* Monthly aid report for all districts */
   DCL DISTFILE FILE RECORD INPUT;
   DCL RPTFILE FILE PRINT;
   DCL 1 DIST_REC,
         2 DIST_ID CHAR(4),
         2 ADM FIXED DEC(9,2);
   DCL TOTAL FIXED DEC(13,2) INIT(0);
   DCL EOF BIT(1) INIT('0'B);
   %INCLUDE AIDCOMM;
   ON ENDFILE(DISTFILE) EOF = '1'B;
   READ FILE(DISTFILE) INTO(DIST_REC);
   DO WHILE (^EOF);
      CALL ACCUM(ADM);
      READ FILE(DISTFILE) INTO(DIST_REC);
   END;
   EXEC SQL INSERT INTO AID_SUMMARY (TOTAL) VALUES (:TOTAL);
   WRITE FILE(RPTFILE) FROM(TOTAL);
 ACCUM: PROC(AMT);
   DCL AMT FIXED DEC(9,2);
   TOTAL = TOTAL + AMT;
 END ACCUM;
 END AIDRPT;
