000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. STUPAY.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS-DB-PASSWORD        PIC X(8) VALUE 'AIDPW01'.
000600*01  WS-OLD-PASSWORD       PIC X(8) VALUE 'OLDPW'.
000700 01  WS-STMT               PIC X(200).
000800 01  STUDENT-REC.
000900     05  STU-SSN           PIC 9(9).
001000     05  STU-BIRTH-DATE    PIC X(8).
001100 PROCEDURE DIVISION.
001200     EXEC SQL PREPARE S1 FROM :WS-STMT END-EXEC.
001300     GOBACK.
