0010 DEFINE DATA
0020 LOCAL USING AIDLDA01
0030 LOCAL
0040 1 DISTRICT VIEW OF DISTRICT-FILE
0050   2 DISTRICT-ID
0060   2 ADM
0070 1 #TOTAL-AID (P11.2)
0080 1 #RATE (N5.4)
0090 END-DEFINE
0100 *
0110 READ DISTRICT BY DISTRICT-ID
0120   IF ADM > 0
0130     PERFORM COMPUTE-AID
0140   END-IF
0150 END-READ
0160 CALLNAT 'AIDPOST1' #TOTAL-AID
0170 INPUT USING MAP 'AIDMAP01'
0180 DEFINE SUBROUTINE COMPUTE-AID
0190   COMPUTE #TOTAL-AID = ADM * #RATE
0200   STORE AID-HISTORY
0210 END-SUBROUTINE
0220 END
