         PRINT NOGEN
         DBD   NAME=AIDDBD,ACCESS=HIDAM
         DATASET DD1=AIDDB01,DEVICE=3390
         SEGM  NAME=DISTRICT,PARENT=0,BYTES=120
         FIELD NAME=(DISTID,SEQ,U),BYTES=4,START=1,TYPE=C
         FIELD NAME=DISTNAME,BYTES=40,START=5,TYPE=C
         SEGM  NAME=PAYMENT,PARENT=DISTRICT,BYTES=60
         FIELD NAME=(PAYDATE,SEQ,M),BYTES=8,START=1,TYPE=C
         FIELD NAME=AMOUNT,BYTES=6,START=9,TYPE=P
         SEGM  NAME=ADJUST,PARENT=PAYMENT,BYTES=40
         DBDGEN
         FINISH
         END
