AIDFMT   FMT
         DEV   TYPE=(3270,2),FEAT=IGNORE
         DIV   TYPE=INOUT
         DPAGE CURSOR=((3,20))
         DFLD  'DISTRICT AID INQUIRY',POS=(1,25)
DISTID   DFLD  POS=(3,20),LTH=4
AMOUNT   DFLD  POS=(5,20),LTH=12
         FMTEND
AIDIN    MSG   TYPE=INPUT,SOR=(AIDFMT,IGNORE)
         SEG
         MFLD  DISTID,LTH=4
         MSGEND
         END
