         PCB   TYPE=TP,LTERM=AIDTERM
         PCB   TYPE=DB,DBDNAME=AIDDBD,PROCOPT=G,KEYLEN=12
         SENSEG NAME=DISTRICT,PARENT=0
         SENSEG NAME=PAYMENT,PARENT=DISTRICT,PROCOPT=A
         PSBGEN LANG=COBOL,PSBNAME=AIDPSB
         END
