AIDMAP   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,       X
               CTRL=FREEKB
AIDMAP1  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,20),LENGTH=30,ATTRB=(ASKIP,BRT),                X
               INITIAL='DISTRICT AID INQUIRY'
DISTID   DFHMDF POS=(5,20),LENGTH=6,ATTRB=(UNPROT,IC)
TOTAL    DFHMDF POS=(7,20),LENGTH=15,ATTRB=(ASKIP,NUM)
         DFHMSD TYPE=FINAL
         END
